1s/ERP/Conf/Catalogs/Лико_ВерсииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ВерсииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Технология</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехнологияПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТехнологияПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйАртикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменаНаВерсию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВерсииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласовано</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
					<Comment>Ставка НДС 5%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5_105</Name>
					<Comment>Расчетная ставка НДС 5/105</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
					<Comment>Ставка НДС 7%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7_107</Name>
					<Comment>Расчетная ставка НДС 7/107</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22_122</Name>
					<Comment>Расчетная ставка НДС 22/122</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
					<Comment>Ставка НДС 22%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ВариантыОформленияПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыОформленияПродажи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РеализацияТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктВыполненныхРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктНаПередачуПрав</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ВариантыИспользованияХарактеристикНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыИспользованияХарактеристикНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеДляВидаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныеДляНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеСДругимВидомНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_Площадки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_Площадки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладГП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УтверждатьЗаказыПередОтправкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресУведомленияПодготовленныеЗаказы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкаДляОтчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ГруппировкиОтчетовНаСайте</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадкаМСФО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПроизводство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОтпускТовараГП</Name>
					<Comment>будет подставляться в реализацию в поле "Отпустил"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольНаличияФотоБиркиРулонногоМатериала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаКонтроляНаличияФотоБиркиРулонногоМатериала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеховаяКладовая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонвертаПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКонвертов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Конверты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОснастки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Директор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеДляБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаПодписьПередач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРаботыВОбработкеПеремоткаУпаковка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БуферСнятыхРоликовПеремотки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ВерсииНоменклатуры/Forms/ФормаСозданияНоменклатуры/Ext/Form/Module.bsl
&НаСервере
Функция СоздатьНоменклатуруНаСервере()
	
	//Артикул=ПолучитьАртикулИзDFM();
	//НачатьТранзакцию();
	//Номенклатура=Лико_Планирование.СоздатьНоменклатуруНаСервере(НаименованиеНоменклатуры,ТипЭтикетки,Регион,Клиент,Артикул,ЗначениеЗаполнено(Артикул));
	//ВерсияНоменклатуры=Справочники.Лико_ВерсииНоменклатуры.СоздатьВерсиюНоменкатуры(Номенклатура,Технология);
	//ЗафиксироватьТранзакцию();

	НачатьТранзакцию();
	НоменклатураDFM=?(ЗначениеЗаполнено(Номенклатура),Номенклатура,Неопределено);
	
	// <-- Начало Лико Яцун С. В. 09.01.2025
	Если ЗначениеЗаполнено(КодЛинкс) И Не НайтиПродукт Тогда
		фКодЛинкс = Формат(КодЛинкс,"ЧЦ=7; ЧВН=; ЧГ=0");
		Номен = Справочники.Номенклатура.НайтиПоРеквизиту("Лико_КодЛинкс",фКодЛинкс);
		Если ЗначениеЗаполнено(Номен) Тогда 
			Текст = СтрШаблон("Номенклатура с такми кодом Линкс уже существует!");
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Текст;
			Сообщение.Поле = "КодЛинкс"; //имя реквизита 
			//Сообщение.УстановитьДанные(); //Ссылка на объект ИБ
			Сообщение.Сообщить();
			Сообщить(СтрШаблон("Номенклатура:%1 %2",Номен.Артикул,Номен.Наименование));
			Возврат Ложь;
		Иначе
			
			АртикулDFM = "011"+ Сред(фКодЛинкс,3,5);
			НоваяВерсия = ЛинксВерсия;
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 09.01.2025
	
	СтруктураНоменклатуры=Справочники.Лико_ВерсииНоменклатуры.СоздатьНоменклатуру
	(НаименованиеНоменклатуры,
	ТипЭтикетки,
	НоваяВерсия,
	Регион,
	Клиент,
	Менеджер,
	Дизайнер,
	Истина,
	НоменклатураDFM,
	?(ЗначениеЗаполнено(АртикулDFM),АртикулDFM,Неопределено)
	,
	,Заказ
	,Комментарий);
	
	
	Если ЗначениеЗаполнено(СтруктураНоменклатуры.Ошибка) Тогда
		Сообщить(СтруктураНоменклатуры.Ошибка);
		Возврат Ложь;
	КонецЕсли;
	
	// <-- Начало Лико Яцун С. В. 09.01.2025
	Если ЗначениеЗаполнено(КодЛинкс) И Не НайтиПродукт Тогда
		НоменклатурыОбъект = СтруктураНоменклатуры.Номенклатура.ПолучитьОбъект();
		НоменклатурыОбъект.Лико_КодЛинкс = Формат(КодЛинкс,"ЧЦ=7; ЧВН=; ЧГ=0");
		НоменклатурыОбъект.Лико_АртикулЛинкс = АртикулЛинкс;
		НоменклатурыОбъект.ОбменДанными.Загрузка = Истина;
		НоменклатурыОбъект.Записать();
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 09.01.2025
	
	Номенклатура      =СтруктураНоменклатуры.Номенклатура;
	Версия            =СтруктураНоменклатуры.Версия;
	ВерсияНоменклатуры  =СтруктураНоменклатуры.ВерсияНоменклатуры;
	//Результат=Справочники.Лико_ВерсииНоменклатуры.СоздатьНоменклатуруВDFM(Клиент,ТипЭтикетки,Номенклатура,НоваяТехнология,НоваяВерсия,Менеджер,Дизайнер);
	ЗафиксироватьТранзакцию();
	Возврат Истина;
КонецФункции

&НаКлиенте
Асинх Процедура СоздатьНоменклатуру(Команда)
	
	Если ПроверкаЗаполненияПолей()Тогда
		Если Полуфабрикат ТОгда
			
			Номенклатура=СоздатьПолуфабрикат(НаименованиеНоменклатуры,Артикул);
			Структура = Новый Структура;
			Структура.Вставить("Номенклатура",Номенклатура);
			Структура.Вставить("ВерсияНоменклатуры",ПредопределенноеЗначение("Справочник.Лико_ВерсииНоменклатуры.ПустаяСсылка"));
			Закрыть(Структура);
			
			
		Иначе
			
			//Режим = РежимДиалогаВопрос.ДаНет;
			//	Ответ = Ждать ВопросАсинх(СтрШаблон("Отправить уведомление дизайнеру :%1?",Дизайнер), Режим, 0);
			//	Если Ответ = КодВозвратаДиалога.Нет Тогда
			//		Дизайнер=Неопределено;
			//	Иначе
			//		ПроверкаЗаполненияПоляДизайнер=Истина;
			//		СообщитьПользователю(Дизайнер,"Дизайнер","Дизайнер",ПроверкаЗаполненияПоляДизайнер); 
			//     Если Не ПроверкаЗаполненияПоляДизайнер Тогда
			//		  Возврат;
			//	КонецЕсли;
			//КонецЕсли;
			
			Если Не ОтправитьУведомление Тогда
				Дизайнер=Неопределено;
			КонецЕсли;
			НоменклатураБылаЗаполнена= ЗначениеЗаполнено(Номенклатура);
			
			Если Не ЗначениеЗаполнено(Номенклатура) Тогда
				Номенклатура=НайтиНоменклатуруКлиентаНаСервере();
				//НоваяТехнология=Технология;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Номенклатура) И
				ЗначениеЗаполнено(НайтиВерсиюНаСервере()) Тогда 
				
				НайденнаяВерсия=НайтиВерсиюНаСервере(); 
				
				Режим = РежимДиалогаВопрос.ДаНет;
				Ответ = Ждать ВопросАсинх(СтрШаблон("Данный продукт : %1 уже существует. Перенести  в  заказ?",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НайденнаяВерсия,"Артикул")), Режим, 0);
				Если Ответ = КодВозвратаДиалога.Нет Тогда
					Если Не НоменклатураБылаЗаполнена Тогда
						Номенклатура=Неопределено;
					КонецЕсли;
					
					Возврат;
				КонецЕсли;
              КонецЕсли;
				
			Если СоздатьНоменклатуруНаСервере() Тогда 
				
				Структура = Новый Структура;
				Структура.Вставить("Номенклатура",Номенклатура);
				Структура.Вставить("ВерсияНоменклатуры",ВерсияНоменклатуры);
				Закрыть(Структура);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Клиент") Тогда
		Клиент=Параметры.Клиент;
	КонецЕсли;
	Если Параметры.Свойство("Контрагент") Тогда
		Контрагент=Параметры.Контрагент;
	КонецЕсли;
	Если Параметры.Свойство("Дизайнер") Тогда
		Дизайнер=Параметры.Дизайнер;
	КонецЕсли;
	Если Параметры.Свойство("Менеджер") Тогда
		Менеджер=Параметры.Менеджер;
	КонецЕсли; 
	//Если Параметры.Свойство("Технология") Тогда
	//	Технология=Параметры.Технология;
	//КонецЕсли;
	Если Параметры.Свойство("Заказ") Тогда
		Заказ=Параметры.Заказ;
	КонецЕсли; 
	
	Если Параметры.Свойство("НайтиПродукт") Тогда
		НайтиПродукт=Параметры.НайтиПродукт;
	КонецЕсли;


	Если Параметры.Свойство("Регион") Тогда
		Регион=Параметры.Регион;
	КонецЕсли; 
	Если Параметры.Свойство("Регион") Тогда
		НаименованиеНоменклатуры=Параметры.НаименованиеНоменклатуры;
	КонецЕсли;
	Если Параметры.Свойство("ТипЭтикетки") Тогда
		ТипЭтикетки=Параметры.ТипЭтикетки;
	КонецЕсли;
	Если Параметры.Свойство("Номенклатура") Тогда
		Номенклатура=Параметры.Номенклатура;
	КонецЕсли;
	Если Параметры.Свойство("Версия") Тогда
		Версия=Параметры.Версия;
		ТекущаяВерсия=Версия;
	КонецЕсли;
	
	Если Параметры.Свойство("ВерсияНоменклатуры") И ЗначениеЗаполнено(Параметры.ВерсияНоменклатуры) Тогда
		ВерсияНоменклатуры=Параметры.ВерсияНоменклатуры;
		//ТекущаяТехнология=ВерсияНоменклатуры.ТехнологияПечати;
		//Технология=ВерсияНоменклатуры.ТехнологияПечати;
	КонецЕсли;
	
	
	Если НайтиПродукт Тогда
		Заголовок="Найти продукт";
		
	ИначеЕсли ЗначениеЗаполнено(Номенклатура) Тогда
		СуществующиеВерсии.Загрузить(Справочники.Лико_ВерсииНоменклатуры.ПолучитьВерсии(Номенклатура));
		
		
		
		УкажитеДействие=1;
		Элементы.КомментарийДизайнер.Заголовок=
		"Указанному сотруднику будет отправлено уведомление о новом артикуле";
		//Элементы.СоздатьНоменклатуру.Заголовок="Создать версию номенклатуры";
		Если ЗначениеЗаполнено(ВерсияНоменклатуры) Тогда 
			ВерсияНоменклатурыАртикул=ВерсияНоменклатуры.Артикул;
		Иначе
			ВерсияНоменклатурыАртикул=Номенклатура.Артикул;
			АртикулDFM=Справочники.Лико_ВерсииНоменклатуры.ПолучитьАртикул();
			
		КонецЕсли;
		
	Иначе
		Заголовок="Новый продукт";
		Элементы.КомментарийДизайнер.Заголовок=
		"Указанному сотруднику будет отправлено уведомление о созданном продукте";
		//Элементы.СоздатьНоменклатуру.Заголовок="Создать номенклатуру";
		
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Номенклатура) И   Не ЗначениеЗаполнено(Технология) И Параметры.Свойство("Технология") Тогда
	//	  УкажитеДействие=2;
	//	  НоваяТехнология=Параметры.Технология;
	//КонецЕсли;

	
	УстановитьВидимость();
	ПриВыбореДействия();
	ПолучитьМассивТехнологий();
	Если  ЗначениеЗаполнено(Дизайнер) ТОгда
		ЕстьПочта=ПроверитьНаличияПочтыУДизайнера();
	КонецЕсли;
	
	Элементы.Дизайнер.Доступность=ОтправитьУведомление;
	
		ПолучитьМассивТехнологий();
		//Элементы.Технология.СписокВыбора.ЗагрузитьЗначения(МассивТехнологий.ВыгрузитьЗначения());

	
	 //СписокВыбора=Элементы.Технология.СписокВыбора;
	 //   СписокВыбора.Очистить();
	 //   
	 //   СписокВыбораНТ=Элементы.НоваяТехнология.СписокВыбора;
	 //   СписокВыбораНТ.Очистить();
	
//	
	//Если Заказ.Площадка<>Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра Тогда
	//	СписокВыбора.Добавить(Справочники.Лико_ТехнологияПечати.Флексо);
	//	СписокВыбора.Добавить(Справочники.Лико_ТехнологияПечати.Офсет);
	//	СписокВыбора.Добавить(Справочники.Лико_ТехнологияПечати.Цифра);
	//	СписокВыбора.Добавить(Справочники.Лико_ТехнологияПечати.GallusInkjet);
	//	СписокВыбора.Добавить(Справочники.Лико_ТехнологияПечати.Глубокая);
	//	
	//	СписокВыбораНТ.Добавить(Справочники.Лико_ТехнологияПечати.Флексо);
	//	СписокВыбораНТ.Добавить(Справочники.Лико_ТехнологияПечати.Офсет);
	//	СписокВыбораНТ.Добавить(Справочники.Лико_ТехнологияПечати.Цифра);
	//	СписокВыбораНТ.Добавить(Справочники.Лико_ТехнологияПечати.GallusInkjet);
	//	СписокВыбораНТ.Добавить(Справочники.Лико_ТехнологияПечати.Глубокая);

	//Иначе
	//	СписокВыбора.Добавить(Справочники.Лико_ТехнологияПечати.Офсет_Глубокая);
	//	СписокВыбора.Добавить(Справочники.Лико_ТехнологияПечати.Офсет_Флексо);
	//	СписокВыбора.Добавить(Справочники.Лико_ТехнологияПечати.Офсет_Флексо_Глубокая);
	//	СписокВыбора.Добавить(Справочники.Лико_ТехнологияПечати.Флексо_Глубокая);
	//	
	//	СписокВыбораНТ.Добавить(Справочники.Лико_ТехнологияПечати.Офсет_Глубокая);
	//	СписокВыбораНТ.Добавить(Справочники.Лико_ТехнологияПечати.Офсет_Флексо);
	//	СписокВыбораНТ.Добавить(Справочники.Лико_ТехнологияПечати.Офсет_Флексо_Глубокая);
	//	СписокВыбораНТ.Добавить(Справочники.Лико_ТехнологияПечати.Флексо_Глубокая);
	//			
	//КонецЕсли;
	
	
КонецПроцедуры

Функция ПолучитьАртикулИзDFM() //+Лико m.shenderov 28.04.2021
	СпрОбъект=Справочники.Лико_ПредопределенныеЗначения.счНоменклатураАртикул.ПолучитьОбъект();
	СпрОбъект.ЗначениеПараметра=СпрОбъект.ЗначениеПараметра+1;
	СпрОбъект.Записать(); 	
	Возврат Формат(СпрОбъект.ЗначениеПараметра,"ЧЦ=8; ЧВН=; ЧГ="); 	
КонецФункции //-Лико m.shenderov 28.04.2021 

Функция ПроверкаЗаполненияПолей() //+Лико m.shenderov 28.04.2021
	Результат=Истина;
	Если Полуфабрикат Тогда
		СообщитьПользователю(НаименованиеНоменклатуры,"НаименованиеНоменклатуры","Наименование",Результат);
		СообщитьПользователю(НаименованиеНоменклатуры,"Артикул","Артикул",Результат);
	Иначе
		
		Если Не (ЗначениеЗаполнено(Номенклатура) И Справочники.Лико_ВерсииНоменклатуры.ЕстьВерсияНоменклатуры(Номенклатура)) Тогда
			СообщитьПользователю(НаименованиеНоменклатуры,"НаименованиеНоменклатуры","Наименование номенклатуры",Результат);
			СообщитьПользователю(ТипЭтикетки,"ТипЭтикетки","Тип этикетки",Результат);
			СообщитьПользователю(Клиент,"Клиент","Клиент",Результат);
			//СообщитьПользователю(Контрагент,"Контрагент","Контрагент",Результат);
			//СообщитьПользователю(Регион,"Регион","Регион",Результат);
			СообщитьПользователю(Менеджер,"Менеджер","Менеджер",Результат);
			//СообщитьПользователю(Дизайнер,"Дизайнер","Дизайнер",Результат);
			//СообщитьПользователю(Технология,"Технология","Технология",Результат);

		Иначе
				//СообщитьПользователю(НоваяТехнология,"НоваяТехнология","НоваяТехнология",Результат);

		КонецЕсли;
	Если ОтправитьУведомление Тогда
		СообщитьПользователю(Дизайнер,"Дизайнер","Дизайнер",Результат); 

		Если Результат И Не ЕстьПочта Тогда
			Результат=Ложь;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("У сотрудника: %1 не заведена почта в 1С . Обратитесь в отдел ИТ.",Дизайнер);
			Сообщение.Поле = "Дизайнер"; //имя реквизита 
			Сообщение.Сообщить();  			
		КонецЕсли;
		
	КонецЕсли;
	
	
	КонецЕсли;
	Возврат Результат;	
КонецФункции //-Лико m.shenderov 28.04.2021 

Процедура СообщитьПользователю(Поле,РеквизитПоля,Текст,Результат)
	Если Не ЗначениеЗаполнено(Поле) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Не заполнено: %1",Текст);
		Сообщение.Поле = РеквизитПоля; //имя реквизита 
		//Сообщение.УстановитьДанные(); //Ссылка на объект ИБ
		Сообщение.Сообщить(); 		
		Результат=Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УказатьВерсиюПриИзменении(Элемент)
	
	
	Элементы.Версия.Видимость=УказатьВерсию;
	
	
	
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимость() //+Лико m.shenderov 18.05.2021
	//
	//Если ЗначениеЗаполнено(Номенклатура) И Справочники.Лико_ВерсииНоменклатуры.ЕстьВерсияНоменклатуры(Номенклатура) Тогда
	//	Элементы.ГруппаОсновная.Видимость=Ложь;
	//	Элементы.ГруппваДополнительно.Видимость=Ложь;
	//Иначе
	//	Элементы.ГруппаОсновная.Видимость=Истина;
	//	Элементы.ГруппваДополнительно.Видимость=Истина;
	//КонецЕсли;
	Если НайтиПродукт Тогда
		
		Элементы.ПоискПоКодуЛинкс.Видимость = Истина;
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда 
			
			Элементы.ГруппаОсновная.Видимость = Ложь;
			Элементы.ГруппаЛинкс.Видимость = Ложь;
			Элементы.ГруппаУкажитеДействие.Видимость = Ложь;
			Элементы.Полуфабрикат.Видимость = Ложь; 
			Элементы.ГруппаУведомление.Видимость = Ложь;
			Элементы.СоздатьНоменклатуру.Видимость = Ложь;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
		Если ЗначениеЗаполнено(Номенклатура) Тогда
		Элементы.ГруппаДопСвойстваНоменклатуры.Видимость   =Истина;
		Элементы.УкажитеДействие.Видимость                 =Ложь;
		Элементы.Полуфабрикат.Видимость                    =Ложь;
		Элементы.НаименованиеНоменклатуры.Видимость        =Ложь;
		Элементы.Технология.Видимость                      =Ложь;
		Элементы.ТипЭтикетки.Видимость                     =Ложь;
		Элементы.Артикул.Видимость 					 	   =Ложь;
		Элементы.ГруппаЛинкс.Видимость 					   =Ложь;
		Элементы.РазделительДизайнер.Видимость             =Истина;
		Элементы.Дизайнер.Видимость                        =Истина;
		Элементы.КомментарийДизайнер.Видимость             =Истина;
        Элементы.ГруппаУкажитеДействие.Видимость           =Истина;
			Элементы.ОтступКомментарий.Ширина=15;  
			Если НайтиПродукт Тогда
				Элементы.НовыйАртикул.Видимость =Ложь;
				Элементы.НоваяВерсия.Видимость = Ложь;
				//Элементы.НоваяВерсияЛинкс.Видимость = Истина;
			КонецЕсли;
			
			
	Если СуществующиеВерсии.Количество()>0 Тогда 
		Элементы.ГруппаСуществующиеВерсии.Видимость		=Истина;
		Элементы.ГруппаУведомление.Видимость			=Ложь;
		Элементы.СоздатьНоменклатуру.Видимость			=Ложь;
		 Элементы.ГруппаУкажитеДействие.Видимость       =Ложь;
		 Элементы.РазделительДизайнер.Видимость			=Ложь;
         	Заголовок="Существующие версии артикула";

	Иначе
		Элементы.ГруппаСуществующиеВерсии.Видимость	=Ложь;
		Элементы.ГруппаУведомление.Видимость		=Истина;
		Элементы.СоздатьНоменклатуру.Видимость		=Истина;
		Элементы.ГруппаУкажитеДействие.Видимость     =Истина;
         Элементы.РазделительДизайнер.Видимость		=Истина;
         Заголовок="Новая версия существующего продукта"; 
		 
		 Если НайтиПродукт Тогда
			 Элементы.НовыйАртикул.Видимость =Ложь;
			 Элементы.НоваяВерсия.Видимость = Ложь;
			 Элементы.НоваяВерсияЛинкс.Видимость = Истина;
		 КонецЕсли;

		
	КонецЕсли;



		
Иначе
	   
		Если Полуфабрикат Тогда
			Элементы.Артикул.Видимость            =Истина;
			Элементы.Технология.Видимость         =Ложь;
			Элементы.ТипЭтикетки.Видимость        =Ложь;
			Элементы.РазделительДизайнер.Видимость=Ложь;
			Элементы.Дизайнер.Видимость           =Ложь;
			Элементы.КомментарийДизайнер.Видимость=Ложь;
		    
			
			
		Иначе
			Элементы.ГруппаДопСвойстваНоменклатуры.Видимость	=Ложь;
			Элементы.УкажитеДействие.Видимость             		=Ложь;
			Элементы.ГруппаУкажитеДействие.Видимость			=Ложь;
			
			Элементы.Полуфабрикат.Видимость                    =Истина;
			Элементы.НаименованиеНоменклатуры.Видимость        =Истина;
			Элементы.Технология.Видимость                      =Ложь;
			Элементы.ТипЭтикетки.Видимость                     =Истина; 	
			
			Элементы.Артикул.Видимость            =Ложь;
			Элементы.Технология.Видимость         =Ложь;
			Элементы.ТипЭтикетки.Видимость        =Истина;
			Элементы.РазделительДизайнер.Видимость=Истина;
			Элементы.Дизайнер.Видимость           =Истина;
			Элементы.КомментарийДизайнер.Видимость=Истина;
			Если Заказ.Площадка = Справочники.Лико_Площадки.Линкс Тогда
				Элементы.ГруппаЛинкс.Видимость 					   =Истина;
			Иначе
				Элементы.ГруппаЛинкс.Видимость 					   =Ложь;
			КонецЕсли;
		КонецЕсли;
	
		
	КонецЕсли;
 	
КонецПроцедуры //-Лико m.shenderov 18.05.2021

Функция НайтиНоменклатуруКлиентаНаСервере() //+Лико m.shenderov 18.05.2021
	Возврат Справочники.Лико_ВерсииНоменклатуры.НайтиНоменклатуруКлиента(НаименованиеНоменклатуры,Клиент);	
КонецФункции //-Лико m.shenderov 18.05.2021 


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Ширина=80;
	ЭтаФорма.Высота=40;
	
КонецПроцедуры


Функция СоздатьПолуфабрикат(НаименованиеПолуфабриката,Артикул) //+Лико m.shenderov 19.05.2021
	
	НоваяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	
	НачатьТранзакцию();
	
	НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
	НоваяНоменклатура.Наименование =НаименованиеПолуфабриката;
	//НоваяНоменклатура.НаименованиеПолное = Текст;
	НоваяНоменклатура.Артикул = Артикул;
	ВидНоменклатуры = Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыПолуфабрикат.ЗначениеПараметра;
	НоваяНоменклатура.ВидНоменклатуры = ВидНоменклатуры;
	НоваяНоменклатура.ГруппаФинансовогоУчета = ВидНоменклатуры.ГруппаФинансовогоУчета;
	НоваяНоменклатура.ГруппаАналитическогоУчета = ВидНоменклатуры.ГруппаАналитическогоУчета;
	//НоваяНоменклатура.Код = Выборка.НоменклатураКод;
	НоваяНоменклатура.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
	//НоваяНоменклатура.ЕдиницаИзмерения =  Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("тыс.шт");
	НоваяНоменклатура.ЕдиницаИзмерения =  ВидНоменклатуры.ЕдиницаИзмерения;
	НоваяНоменклатура.ЕдиницаДляОтчетов = ВидНоменклатуры.ЕдиницаДляОтчетов;
	НоваяНоменклатура.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
	НоваяНоменклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
	НоваяНоменклатура.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры;
	НоваяНоменклатура.ВладелецХарактеристик =Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыДляХраненияХарактеристикНарезки.ЗначениеПараметра;
	НоваяНоменклатура.ИспользоватьУпаковки = Истина;
	//НоваяНоменклатура.НаборУпаковок =  Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("тыс.шт");
	НоваяНоменклатура.НаборУпаковок = ВидНоменклатуры.НаборУпаковок;
	НоваяНоменклатура.ГруппаДоступа = Справочники.ГруппыДоступаНоменклатуры.НайтиПоНаименованию("Материалы товары");
	НоваяНоменклатура.СкладскаяГруппа =  Справочники.Лико_ПредопределенныеЗначения.СкладскаяГруппаНоменклатурыДляГП.ЗначениеПараметра;
	//НоваяНоменклатура.Лико_ТипЭтикетки = ТипЭтикетки;
	
	
	
	
	
	
	НоваяНоменклатура.Записать();
	//Если  Не ЗначениеЗаполнено(Артикул) Тогда 
	//	НоваяНоменклатура.Артикул =  Лико_Планирование.КодБезНулей(НоваяНоменклатура.Код) + "-0";
	//	НоваяНоменклатура.Записать();
	//КонецЕсли;
	
	МассивСтруктур = Новый Массив;
	МассивСтруктур.Добавить(Новый Структура("Свойство, Значение",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Партнер", Истина),Клиент));
	УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(НоваяНоменклатура.Ссылка,МассивСтруктур);
	
	ЗафиксироватьТранзакцию();
	
	
	Возврат НоваяНоменклатура.Ссылка; 
	
	
КонецФункции //-Лико m.shenderov 19.05.2021

&НаКлиенте
Процедура ПолуфабрикатПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ТехнологияПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТехнологияПриИзменении(Элемент)
	//ТехнологияПриИзмененииНаСервере();
КонецПроцедуры

Процедура ПриВыбореДействия()
	
	
	Если УкажитеДействие=1 Тогда
		ТехнологияОстается=Технология;
		НоваяВерсия=Справочники.Лико_ВерсииНоменклатуры.ПолучитьНовуюВерсиюНоменклатуры(Номенклатура);
		НоваяТехнология=Технология;
		Элементы.НоваяТехнология.Заголовок="Останется технология";
		Элементы.НоваяВерсия.Заголовок="Будет назначена версия";
		Элементы.НоваяТехнология.Вид=ВидПоляФормы.ПолеНадписи;
		
		//НовыйАртикул=СтрШаблон("%1-%2-%3",Номенклатура.Артикул,НоваяВерсия,НоваяТехнология.Код);		
	ИначеЕсли УкажитеДействие=2 Тогда
		ТехнологияОстается=Технология;
		НоваяВерсия=Версия;
		//НоваяТехнология=Технология;
		НоваяТехнология=Неопределено;

		
		Элементы.НоваяТехнология.Заголовок="Укажите технологию";
		Элементы.НоваяВерсия.Заголовок="Останется версия";

		Элементы.НоваяТехнология.Вид=ВидПоляФормы.ПолеВвода;
		Элементы.НоваяТехнология.РежимВыбораИзСписка=Истина;
		Элементы.НоваяТехнология.КнопкаСоздания=Ложь;
		ПолучитьМассивТехнологий(Технология);
		Элементы.НоваяТехнология.СписокВыбора.ЗагрузитьЗначения(МассивТехнологий.ВыгрузитьЗначения());
		//НовыйАртикул=СтрШаблон("%1-%2-%3",Номенклатура.Артикул,НоваяВерсия,НоваяТехнология.Код);
		
		
		
	ИначеЕсли УкажитеДействие=3 Тогда 
		ТехнологияОстается=Технология;
		НоваяВерсия=Справочники.Лико_ВерсииНоменклатуры.ПолучитьНовуюВерсиюНоменклатуры(Номенклатура);
		//НоваяТехнология=Технология;
		НоваяТехнология=Неопределено;
		Элементы.НоваяТехнология.Заголовок="Укажите технологию";
		Элементы.НоваяВерсия.Заголовок="Будет назначена версия";
		Элементы.НоваяТехнология.Вид=ВидПоляФормы.ПолеВвода;
		Элементы.НоваяТехнология.РежимВыбораИзСписка=Истина;
		Элементы.НоваяТехнология.КнопкаСоздания=Ложь;
		ПолучитьМассивТехнологий(Технология);
		Элементы.НоваяТехнология.СписокВыбора.ЗагрузитьЗначения(МассивТехнологий.ВыгрузитьЗначения());

		//НовыйАртикул=СтрШаблон("%1-%2-%3",Номенклатура.Артикул,НоваяВерсия,НоваяТехнология.Код);
	КонецЕсли;
	
	ПолучитьНовыйАртикул();	
		
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура УкажитеДействиеПриИзменении(Элемент)
	ПриВыбореДействия();
КонецПроцедуры

Процедура ПолучитьНовыйАртикул()
	
НовыйАртикул=СтрШаблон("%1-%2",
?(ЗначениеЗаполнено(АртикулDFM),АртикулDFM,Номенклатура.Артикул),
НоваяВерсия);
	
	
КонецПроцедуры

&НаКлиенте
Процедура Версия1ПриИзменении(Элемент)
	ПриВыбореДействия();

КонецПроцедуры

Процедура ПолучитьМассивТехнологий(ИсключитьТехнологию=Неопределено) //+Лико m.shenderov 21.05.2021
	ИксПак=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра=Заказ.Площадка.Организация;
	
	МассивИксПак= Новый СписокЗначений; 
	МассивИксПак.Добавить(Справочники.Лико_ТехнологияПечати.Офсет_Глубокая);
	МассивИксПак.Добавить(Справочники.Лико_ТехнологияПечати.Офсет_Флексо);
	МассивИксПак.Добавить(Справочники.Лико_ТехнологияПечати.Офсет_Флексо_Глубокая);
	МассивИксПак.Добавить(Справочники.Лико_ТехнологияПечати.Флексо_Глубокая); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ТехнологияПечати.Ссылка КАК Ссылка,
	|	Лико_ТехнологияПечати.Код КАК Код
	|ИЗ
	|	Справочник.Лико_ТехнологияПечати КАК Лико_ТехнологияПечати
	|ГДЕ
	|	Лико_ТехнологияПечати.Ссылка <> &ИсключитьТехнологию
	|	И Лико_ТехнологияПечати.Ссылка В(&МассивИксПак)
	|	И &ИксПак
	|	И Лико_ТехнологияПечати.Код <> 6
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_ТехнологияПечати.Ссылка,
	|	Лико_ТехнологияПечати.Код
	|ИЗ
	|	Справочник.Лико_ТехнологияПечати КАК Лико_ТехнологияПечати
	|ГДЕ
	|	Лико_ТехнологияПечати.Ссылка <> &ИсключитьТехнологию
	|	И НЕ Лико_ТехнологияПечати.Ссылка В (&МассивИксПак)
	|	И НЕ &ИксПак
	|	И Лико_ТехнологияПечати.Код <> 6
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	Запрос.УстановитьПараметр("ИсключитьТехнологию",ИсключитьТехнологию);
	Запрос.УстановитьПараметр("МассивИксПак",МассивИксПак);
	Запрос.УстановитьПараметр("ИксПак",ИксПак);
	
	МассивТехнологий = Новый СписокЗначений;
	МассивТехнологий.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 21.05.2021

&НаКлиенте
Процедура НоваяТехнологияПриИзменении(Элемент)
	ПолучитьНовыйАртикул();
КонецПроцедуры

Функция НайтиВерсиюНаСервере() //+Лико m.shenderov 24.05.2021
	Возврат Справочники.Лико_ВерсииНоменклатуры.НайтиВерсиюНоменклатуры(Номенклатура,НоваяВерсия);	
КонецФункции //-Лико m.shenderov 24.05.2021 

&НаКлиенте
Процедура ДизайнерПриИзменении(Элемент)
	ЕстьПочта=ПроверитьНаличияПочтыУДизайнера();
КонецПроцедуры

Функция ПроверитьНаличияПочтыУДизайнера();
	
	Почта=Справочники.Лико_ВерсииНоменклатуры.ПолучитьEmail(Дизайнер);
	Если ЗначениеЗаполнено(Почта) Тогда
				
		Элементы.Группа1Дизайнер.Видимость=ОтправитьУведомление;
		Элементы.Группа2Дизайнер.Видимость=Ложь;
		Возврат Истина;
	Иначе
		Элементы.Группа1Дизайнер.Видимость=Ложь;
		Элементы.Группа2Дизайнер.Видимость=ОтправитьУведомление;
        Возврат Ложь;

	КонецЕсли;
	


		
КонецФункции //-Лико m.shenderov 19.07.2021

&НаКлиенте
Процедура ОтправитьУведомлениеПриИзменении(Элемент)
	Элементы.Дизайнер.Доступность=ОтправитьУведомление;
	ЕстьПочта=ПроверитьНаличияПочтыУДизайнера();

КонецПроцедуры

&НаСервере
Процедура СуществующиеВерсииВыборПриИзмененииНаСервере()
Для каждого ТекВерсия Из СуществующиеВерсии Цикл
	 ТекВерсия.Выбор=Ложь;
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СуществующиеВерсииВыборПриИзменении(Элемент)
	ТД=Элементы.СуществующиеВерсии.ТекущиеДанные;
	Выбор=ТД.Выбор;
	СуществующиеВерсииВыборПриИзмененииНаСервере(); 
	ТД.Выбор=Выбор;  
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяВерсия(Команда)
	СуществующиеВерсии.Очистить();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьСуществующуюВерсию(Команда)
	Для каждого СтрВерсия Из  СуществующиеВерсии Цикл
		
		Если СтрВерсия.Выбор Тогда
			
			Структура = Новый Структура;
				Структура.Вставить("Номенклатура",Номенклатура);
				Структура.Вставить("ВерсияНоменклатуры",СтрВерсия.ВерсияНоменклатуры);
				Закрыть(Структура);
	            Возврат;
			
		КонецЕсли;
		

		
		
	КонецЦикла;

	ПредупреждениеАсинх("Не выбрана версия!");
		

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СуществующиеВерсииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		СтандартнаяОбработка=Ложь;
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ЗаказКлиента) Тогда
		//ПоказатьЗначение(,Элемент.ТекущиеДанные.ЗаказКлиента); 
		ОткрытьФорму("Документ.ЗаказКлиента.Форма.Лико_ФормаДокумента",Новый Структура("Ключ",Элемент.ТекущиеДанные.ЗаказКлиента),ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПоискПоКодуЛинксПриИзмененииНаСервере()
	Номен = Справочники.Номенклатура.НайтиПоРеквизиту("Лико_КодЛинкс", Формат(КодЛинкс, "ЧЦ=7; ЧВН=; ЧГ=")); 
	
	Если Номен.ВидНоменклатуры.Лико_НоменклатураЭтикеток Тогда
		Номенклатура = Номен;
	Иначе
		Номенклатура = Неопределено;
	КонецЕсли;
	
	
	
	СуществующиеВерсии.Загрузить(Справочники.Лико_ВерсииНоменклатуры.ПолучитьВерсии(Номенклатура));
	 
	НаименованиеНоменклатуры=Номенклатура.Наименование; 
	ТипЭтикетки=Номенклатура.Лико_ТипЭтикетки;
	
	
	
	УкажитеДействие=1;
	Элементы.КомментарийДизайнер.Заголовок=
	"Указанному сотруднику будет отправлено уведомление о новом артикуле";
	//Элементы.СоздатьНоменклатуру.Заголовок="Создать версию номенклатуры";
	Если ЗначениеЗаполнено(ВерсияНоменклатуры) Тогда 
		ВерсияНоменклатурыАртикул=ВерсияНоменклатуры.Артикул;
	Иначе
		ВерсияНоменклатурыАртикул=Номенклатура.Артикул;
		АртикулDFM=Справочники.Лико_ВерсииНоменклатуры.ПолучитьАртикул();
		
	КонецЕсли;
    ПриВыбореДействия();

	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоКодуЛинксПриИзменении(Элемент)
	ПоискПоКодуЛинксПриИзмененииНаСервере();
КонецПроцедуры
